node {
  name: "input_x1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "input_x2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "input_y"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "dropout_keep_prob"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "embedding/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "P\002\000\000d\000\000\000"
      }
    }
  }
}
node {
  name: "embedding/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.0
      }
    }
  }
}
node {
  name: "embedding/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "embedding/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "embedding/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "embedding/random_uniform/sub"
  op: "Sub"
  input: "embedding/random_uniform/max"
  input: "embedding/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding/random_uniform/mul"
  op: "Mul"
  input: "embedding/random_uniform/RandomUniform"
  input: "embedding/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding/random_uniform"
  op: "Add"
  input: "embedding/random_uniform/mul"
  input: "embedding/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "embedding/W"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 592
        }
        dim {
          size: 100
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "embedding/W/Assign"
  op: "Assign"
  input: "embedding/W"
  input: "embedding/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding/W"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "embedding/W/read"
  op: "Identity"
  input: "embedding/W"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding/W"
      }
    }
  }
}
node {
  name: "embedding/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 592
        }
        dim {
          size: 100
        }
      }
    }
  }
}
node {
  name: "embedding/embedding_lookup"
  op: "Gather"
  input: "embedding/W/read"
  input: "input_x1"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding/W"
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "embedding/embedding_lookup_1"
  op: "Gather"
  input: "embedding/W/read"
  input: "input_x2"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@embedding/W"
      }
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "output/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "output/transpose"
  op: "Transpose"
  input: "embedding/embedding_lookup"
  input: "output/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377d\000\000\000"
      }
    }
  }
}
node {
  name: "output/Reshape"
  op: "Reshape"
  input: "output/transpose"
  input: "output/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "output/split"
  op: "Split"
  input: "output/split/split_dim"
  input: "output/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 20
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/Shape"
  op: "Shape"
  input: "output/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice"
  op: "StridedSlice"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/Shape"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice/stack"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice/stack_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/stack/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/stack"
  op: "Pack"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/stack/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/zeros/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/zeros"
  op: "Fill"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/stack"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/stack_1/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/stack_1"
  op: "Pack"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/strided_slice"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/stack_1/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/zeros_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/zeros_1"
  op: "Fill"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/stack_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/zeros_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "n\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.20000000298
      }
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298
      }
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/max"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/RandomUniform"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform"
  op: "Add"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/mul"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 110
        }
        dim {
          size: 40
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Assign"
  op: "Assign"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/read"
  op: "Identity"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/basic_lstm_cell/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/basic_lstm_cell/concat"
  op: "ConcatV2"
  input: "output/split"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/zeros_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/basic_lstm_cell/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/basic_lstm_cell/MatMul"
  op: "MatMul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/basic_lstm_cell/concat"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 40
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 40
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/Assign"
  op: "Assign"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/read"
  op: "Identity"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/BiasAdd"
  op: "BiasAdd"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/basic_lstm_cell/MatMul"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/split"
  op: "Split"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/split/split_dim"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/add"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/split:2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Sigmoid"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/mul"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/zeros"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Sigmoid_1"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Tanh"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/mul_1"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Sigmoid_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/add_1"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Tanh_1"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Sigmoid_2"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/mul_2"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Tanh_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/basic_lstm_cell/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/basic_lstm_cell/concat"
  op: "ConcatV2"
  input: "output/split:1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/mul_2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/basic_lstm_cell/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/basic_lstm_cell/MatMul"
  op: "MatMul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/basic_lstm_cell/concat"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/BiasAdd"
  op: "BiasAdd"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/basic_lstm_cell/MatMul"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/split"
  op: "Split"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/split/split_dim"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/add"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/split:2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Sigmoid"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/mul"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell/add_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Sigmoid_1"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Tanh"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/mul_1"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Sigmoid_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/add_1"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Tanh_1"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Sigmoid_2"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/mul_2"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Tanh_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/basic_lstm_cell/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/basic_lstm_cell/concat"
  op: "ConcatV2"
  input: "output/split:2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/mul_2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/basic_lstm_cell/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/basic_lstm_cell/MatMul"
  op: "MatMul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/basic_lstm_cell/concat"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/BiasAdd"
  op: "BiasAdd"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/basic_lstm_cell/MatMul"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/split"
  op: "Split"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/split/split_dim"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/add"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/split:2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Sigmoid"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/mul"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_1/add_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Sigmoid_1"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Tanh"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/mul_1"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Sigmoid_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/add_1"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Tanh_1"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Sigmoid_2"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/mul_2"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Tanh_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/basic_lstm_cell/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/basic_lstm_cell/concat"
  op: "ConcatV2"
  input: "output/split:3"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/mul_2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/basic_lstm_cell/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/basic_lstm_cell/MatMul"
  op: "MatMul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/basic_lstm_cell/concat"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/BiasAdd"
  op: "BiasAdd"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/basic_lstm_cell/MatMul"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/split"
  op: "Split"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/split/split_dim"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/add"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/split:2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Sigmoid"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/mul"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_2/add_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Sigmoid_1"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Tanh"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/mul_1"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Sigmoid_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/add_1"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Tanh_1"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Sigmoid_2"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/mul_2"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Tanh_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/basic_lstm_cell/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/basic_lstm_cell/concat"
  op: "ConcatV2"
  input: "output/split:4"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/mul_2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/basic_lstm_cell/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/basic_lstm_cell/MatMul"
  op: "MatMul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/basic_lstm_cell/concat"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/BiasAdd"
  op: "BiasAdd"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/basic_lstm_cell/MatMul"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/split"
  op: "Split"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/split/split_dim"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "num_split"
    value {
      i: 4
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/add"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/split:2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Sigmoid"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/mul"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_3/add_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Sigmoid"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Sigmoid_1"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/split"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Tanh"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/split:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/mul_1"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Sigmoid_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Tanh"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/add_1"
  op: "Add"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Tanh_1"
  op: "Tanh"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Sigmoid_2"
  op: "Sigmoid"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/split:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/mul_2"
  op: "Mul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Tanh_1"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/Sigmoid_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/basic_lstm_cell/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/basic_lstm_cell/concat"
  op: "ConcatV2"
  input: "output/split:5"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_4/mul_2"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/basic_lstm_cell/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/basic_lstm_cell/MatMul"
  op: "MatMul"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/basic_lstm_cell/concat"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/BiasAdd"
  op: "BiasAdd"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/basic_lstm_cell/MatMul"
  input: "bwside1/bidirectional_rnn/fw/basic_lstm_cell/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/split"
  op: "Split"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/split/split_dim"
  input: "output/bwside1_1/bwside1/bidirectional_rnn/fw/fw/basic_lstm_cell_5/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
